title: SSH Brute Force Detection

id: 001

status: experimental

description: Detects multiple failed SSH login attempts

author: Amratya Khanduja

logsource:
  product: linux
  service: ssh

detection:
  selection:
    message|contains:
      - "Failed password"

  condition: selection

level: high

tags:
  - attack.t1110
