title: Linux User Creation

id: 002

status: experimental

description: Detects creation of new local users

author: Amratya Khanduja

logsource:
  product: linux

detection:
  selection:
    message|contains:
      - "useradd"

  condition: selection

level: medium

tags:
  - attack.t1136
